## Part 1

Applying simple `apply` method to the column

In [24]:
import pandas as pd

titanic = pd.read_csv('/home/rh/Документи/udemy python DA/data/titanic.csv')

titanic['age'] = titanic['age'].replace(['?'], [None]).astype('float')
titanic['age']

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [25]:
# 'case when' in SQL

def age_grade(x):
    if x < 2:
        return 'infant'
    elif x < 10:
        return 'child'
    elif x < 18:
        return 'teen'
    elif x < 40:
        return 'adult'
    else:
        return 'senior'

In [26]:
age_grade(57)

'senior'

In [27]:
# to apply 'apply' method by rows (not by columns as shown below), use 'axis=1' argument

titanic['age'].apply(age_grade)

0        adult
1       infant
2        child
3        adult
4        adult
         ...
1304      teen
1305    senior
1306     adult
1307     adult
1308     adult
Name: age, Length: 1309, dtype: object

## Part 2

Applying `apply` method with `lambda` argument

In [45]:
titanic['fare'] = titanic['fare'].replace(['?'], [None]).astype('float')
titanic['fare']

0       211.3375
1       151.5500
2       151.5500
3       151.5500
4       151.5500
          ...
1304     14.4542
1305     14.4542
1306      7.2250
1307      7.2250
1308      7.8750
Name: fare, Length: 1309, dtype: float64

In [46]:
titanic['fare'].apply(lambda x: f'${x*2}')

0       $422.675
1         $303.1
2         $303.1
3         $303.1
4         $303.1
          ...
1304    $28.9084
1305    $28.9084
1306      $14.45
1307      $14.45
1308      $15.75
Name: fare, Length: 1309, dtype: object

## Part 3

Applying `map` method

In [47]:
titanic['pclass']

0       1
1       1
2       1
3       1
4       1
       ..
1304    3
1305    3
1306    3
1307    3
1308    3
Name: pclass, Length: 1309, dtype: int64

In [48]:
titanic['pclass'].map({1:'1st', 2:'2nd', 3:'3rd'})

0       1st
1       1st
2       1st
3       1st
4       1st
       ...
1304    3rd
1305    3rd
1306    3rd
1307    3rd
1308    3rd
Name: pclass, Length: 1309, dtype: object

In [52]:
# map method could also be used to apply function to the entire dataset

titanic[['name', 'sex', 'home.dest']].map(len)

      name  sex  home.dest
0       29    6         12
1       30    4         31
2       28    6         31
3       36    4         31
4       47    6         31
...    ...  ...        ...
1304    20    6          1
1305    21    6          1
1306    25    4          1
1307    19    4          1
1308    18    4          1

[1309 rows x 3 columns]

In [53]:
titanic[['name', 'sex', 'home.dest']]

,name,sex,home.dest
0,"Allen, Miss. Elisabeth Walton",female,"St Louis, MO"
1,"Allison, Master. Hudson Trevor",male,"Montreal, PQ / Chesterville, ON"
2,"Allison, Miss. Helen Loraine",female,"Montreal, PQ / Chesterville, ON"
3,"Allison, Mr. Hudson Joshua Creighton",male,"Montreal, PQ / Chesterville, ON"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,"Montreal, PQ / Chesterville, ON"
...,...,...,...
1304,"Zabour, Miss. Hileni",female,?
1305,"Zabour, Miss. Thamine",female,?
1306,"Zakarian, Mr. Mapriededer",male,?
1307,"Zakarian, Mr. Ortin",male,?
1308,"Zimmerman, Mr. Leo",male,?